yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3146.h
/* External interrupt status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PBF         : 1;
  unsigned char PDF         : 1;
  unsigned char PEF         : 1;
  unsigned char PFF         : 1;
} __BITS_EXTI_SR2;
#endif
__IO_REG8_BIT(EXTI_SR2,    0x50A4, __READ_WRITE, __BITS_EXTI_SR2);

/* External interrupt port select register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PBLIS       : 1;
  unsigned char PBHIS       : 1;
  unsigned char PDLIS       : 1;
  unsigned char PDHIS       : 1;
  unsigned char PELIS       : 1;
  unsigned char PEHIS       : 1;
  unsigned char PFLIS       : 1;
  unsigned char PFES        : 1;
} __BITS_EXTI_CONF;
#endif
__IO_REG8_BIT(EXTI_CONF,   0x50A5, __READ_WRITE, __BITS_EXTI_CONF);


/*-------------------------------------------------------------------------
 *      ITC - EXTI bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define EXTI_CR1_P0IS            EXTI_CR1_bit.P0IS
#define EXTI_CR1_P1IS            EXTI_CR1_bit.P1IS
#define EXTI_CR1_P2IS            EXTI_CR1_bit.P2IS
#define EXTI_CR1_P3IS            EXTI_CR1_bit.P3IS

#define EXTI_CR2_P4IS            EXTI_CR2_bit.P4IS
#define EXTI_CR2_P5IS            EXTI_CR2_bit.P5IS
#define EXTI_CR2_P6IS            EXTI_CR2_bit.P6IS
#define EXTI_CR2_P7IS            EXTI_CR2_bit.P7IS

#define EXTI_CR3_PBIS            EXTI_CR3_bit.PBIS
#define EXTI_CR3_PDIS            EXTI_CR3_bit.PDIS
#define EXTI_CR3_PEIS            EXTI_CR3_bit.PEIS
#define EXTI_CR3_PFIS            EXTI_CR3_bit.PFIS

#define EXTI_SR1_P0F             EXTI_SR1_bit.P0F
#define EXTI_SR1_P1F             EXTI_SR1_bit.P1F
#define EXTI_SR1_P2F             EXTI_SR1_bit.P2F
#define EXTI_SR1_P3F             EXTI_SR1_bit.P3F
#define EXTI_SR1_P4F             EXTI_SR1_bit.P4F
#define EXTI_SR1_P5F             EXTI_SR1_bit.P5F
#define EXTI_SR1_P6F             EXTI_SR1_bit.P6F
#define EXTI_SR1_P7F             EXTI_SR1_bit.P7F

#define EXTI_SR2_PBF             EXTI_SR2_bit.PBF
#define EXTI_SR2_PDF             EXTI_SR2_bit.PDF
#define EXTI_SR2_PEF             EXTI_SR2_bit.PEF
#define EXTI_SR2_PFF             EXTI_SR2_bit.PFF

#define EXTI_CONF_PBLIS          EXTI_CONF_bit.PBLIS
#define EXTI_CONF_PBHIS          EXTI_CONF_bit.PBHIS
#define EXTI_CONF_PDLIS          EXTI_CONF_bit.PDLIS
#define EXTI_CONF_PDHIS          EXTI_CONF_bit.PDHIS
#define EXTI_CONF_PELIS          EXTI_CONF_bit.PELIS
#define EXTI_CONF_PEHIS          EXTI_CONF_bit.PEHIS
#define EXTI_CONF_PFLIS          EXTI_CONF_bit.PFLIS
#define EXTI_CONF_PFES           EXTI_CONF_bit.PFES

#endif

/*-------------------------------------------------------------------------
 *      ITC - EXTI bit masks
 *-----------------------------------------------------------------------*/
#define MASK_EXTI_CR1_P0IS       0x03
#define MASK_EXTI_CR1_P1IS       0x0C
#define MASK_EXTI_CR1_P2IS       0x30
#define MASK_EXTI_CR1_P3IS       0xC0

#define MASK_EXTI_CR2_P4IS       0x03
#define MASK_EXTI_CR2_P5IS       0x0C
#define MASK_EXTI_CR2_P6IS       0x30
#define MASK_EXTI_CR2_P7IS       0xC0

#define MASK_EXTI_CR3_PBIS       0x03
#define MASK_EXTI_CR3_PDIS       0x0C
#define MASK_EXTI_CR3_PEIS       0x30
#define MASK_EXTI_CR3_PFIS       0xC0

#define MASK_EXTI_SR1_P0F        0x01
#define MASK_EXTI_SR1_P1F        0x02
#define MASK_EXTI_SR1_P2F        0x04
#define MASK_EXTI_SR1_P3F        0x08
#define MASK_EXTI_SR1_P4F        0x10
#define MASK_EXTI_SR1_P5F        0x20
#define MASK_EXTI_SR1_P6F        0x40
#define MASK_EXTI_SR1_P7F        0x80

#define MASK_EXTI_SR2_PBF        0x01
#define MASK_EXTI_SR2_PDF        0x02
#define MASK_EXTI_SR2_PEF        0x04
#define MASK_EXTI_SR2_PFF        0x08

#define MASK_EXTI_CONF_PBLIS     0x01
#define MASK_EXTI_CONF_PBHIS     0x02
#define MASK_EXTI_CONF_PDLIS     0x04
#define MASK_EXTI_CONF_PDHIS     0x08
#define MASK_EXTI_CONF_PELIS     0x10
#define MASK_EXTI_CONF_PEHIS     0x20
#define MASK_EXTI_CONF_PFLIS     0x40
#define MASK_EXTI_CONF_PFES      0x80


/*-------------------------------------------------------------------------
 *      WFE register definitions
 *-----------------------------------------------------------------------*/
/* WFE control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM2_EV0    : 1;
  unsigned char TIM2_EV1    : 1;
  unsigned char TIM1_EV0    : 1;
  unsigned char TIM1_EV1    : 1;
  unsigned char EXTI_EV0    : 1;
  unsigned char EXTI_EV1    : 1;
  unsigned char EXTI_EV2    : 1;
  unsigned char EXTI_EV3    : 1;
} __BITS_WFE_CR1;
#endif
__IO_REG8_BIT(WFE_CR1,     0x50A6, __READ_WRITE, __BITS_WFE_CR1);

/* WFE control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EXTI_EV4    : 1;
  unsigned char EXTI_EV5    : 1;
  unsigned char EXTI_EV6    : 1;
  unsigned char EXTI_EV7    : 1;
  unsigned char EXTI_EVB    : 1;
  unsigned char EXTI_EVD    : 1;
  unsigned char EXTI_EVF    : 1;
  unsigned char ADC1_COMP_EV: 1;
} __BITS_WFE_CR2;
#endif
__IO_REG8_BIT(WFE_CR2,     0x50A7, __READ_WRITE, __BITS_WFE_CR2);

/* WFE control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM3_EV0    : 1;
  unsigned char TIM3_EV1    : 1;
  unsigned char TIM4_EV     : 1;
  unsigned char SPI1_EV     : 1;
  unsigned char I2C1_EV     : 1;
  unsigned char USART1_EV   : 1;
  unsigned char DMA1CH01_EV : 1;
  unsigned char DMA1CH23_EV : 1;
} __BITS_WFE_CR3;
#endif
__IO_REG8_BIT(WFE_CR3,     0x50A8, __READ_WRITE, __BITS_WFE_CR3);


/*-------------------------------------------------------------------------
 *      WFE bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define WFE_CR1_TIM2_EV0         WFE_CR1_bit.TIM2_EV0
#define WFE_CR1_TIM2_EV1         WFE_CR1_bit.TIM2_EV1
#define WFE_CR1_TIM1_EV0         WFE_CR1_bit.TIM1_EV0
#define WFE_CR1_TIM1_EV1         WFE_CR1_bit.TIM1_EV1
#define WFE_CR1_EXTI_EV0         WFE_CR1_bit.EXTI_EV0
#define WFE_CR1_EXTI_EV1         WFE_CR1_bit.EXTI_EV1
#define WFE_CR1_EXTI_EV2         WFE_CR1_bit.EXTI_EV2
#define WFE_CR1_EXTI_EV3         WFE_CR1_bit.EXTI_EV3

